import React, { useMemo, useState } from 'react'
import classes from './TreeSelect.module.css'

const categories = [
	{
		name: "Транспорт",
		subcategories: [
			{ name: "Автомобили ›" },
			{
				name: "Мотоциклы и мототехника ›",
				subcategories: [
					"Вездеходы",
					"Картинг",
					"Квадроциклы и багги",
					"Мопеды и скутеры",
					"Мотоциклы",
					"Снегоходы",
				],
			},
			{
				name: "Грузовики и спецтехника ›",
				subcategories: [
					"Автобусы",
					"Автодома",
					"Автокраны",
					"Бульдозеры",
					"Грузовики",
					"Коммунальная техника",
					"Лёгкий коммерческий транспорт",
					"Навесное оборудование",
					"Погрузчики",
					"Прицепы",
					"Сельхозтехника",
					"Строительная техника",
					"Техника для лесозаготовки",
					"Тягачи",
					"Экскаваторы",
					"Другое",
				],
			},
			{
				name: "Аренда спецтехники ›",
				subcategories: [
					"Подъёмная техника",
					"Землеройная техника",
					"Коммунальная техника",
					"Дорожно-строительная техника",
					"Грузовой транспорт",
					"Погрузочная техника",
					"Навесное оборудование",
					"Прицепы",
					"Сельхозтехника",
					"Другое",
				],
			},
			{
				name: "Водный транспорт ›",
				subcategories: [
					"Вёсельные лодки",
					"Гидроциклы",
					"Катера и яхты",
					"Моторные лодки и моторы",
				],
			},
			{
				name: "Запчасти и аксессуары ›",
				subcategories: [
					"Запчасти",
					"Шины, диски и колёса",
					"Аудио- и видеотехника",
					"Аксессуары",
					"Тюнинг",
					"Багажники и фаркопы",
					"Инструменты",
					"Прицепы",
					"Экипировка",
					"Масла и автохимия",
					"Противоугонные устройства",
					"GPS-навигаторы",
				],
			},
		],
	},
	{
		name: "Недвижимость",
		subcategories: [
			{
				name: "Купить жилье ›",
				subcategories: [
					"Все квартиры",
					"Вторичка",
					"Новостройки",
					"Дома, дачи, коттеджи",
					"Комнаты",
				],
			},
			{
				name: "Снять посуточно ›",
				subcategories: [
					"Квартиры",
					"Дома, дачи и коттеджи",
					"Комнаты и койко-места",
				],
			},
			{
				name: "Снять долгосрочно ›",
				subcategories: [
					"Квартиры",
					"Дома, дачи и коттеджи",
					"Комнаты и койко-места",
				],
			},
			{
				name: "Коммерческая недвижимость ›",
				subcategories: ["Купить", "Снять"],
			},
			{
				name: "Другие категории ›",
				subcategories: [
					"Земельные участки",
					"Гаражи и машиноместа",
					"Зарубежная недвижимость",
				],
			},
		],
	},
	{
		name: "Работа",
		subcategories: [
			{
				name: "Ищу работу ›",
				subcategories: [
					"IT, интернет, телеком",
					"Автомобильный бизнес",
					"Административная работа",
					"Банки, инвестиции",
					"Без опыта",
					"Бухгалтерия, финансы",
					"Высший менеджмент",
					"Госслужба, НКО",
					"Домашний персонал",
					"ЖКХ, эксплуатация",
					"Искусство, развлечения",
					"Консультирование",
					"Курьерская доставка",
					"Маркетинг, реклама, PR",
					"Медицина, фармацевтика",
					"Образование, наука",
					"Охрана, безопасность",
					"Продажи",
					"Производство, сырьё, с/х",
					"Страхование",
					"Строительство",
					"Такси",
					"Транспорт, логистика",
					"Туризм, рестораны",
					"Управление персоналом",
					"Фитнес, салоны красоты",
					"Юриспруденция",
				],
			},
			{
				name: "Ищу сотрудника ›",
				subcategories: [
					"IT, интернет, телеком",
					"Автомобильный бизнес",
					"Административная работа",
					"Банки, инвестиции",
					"Без опыта",
					"Бухгалтерия, финансы",
					"Высший менеджмент",
					"Госслужба, НКО",
					"Домашний персонал",
					"ЖКХ, эксплуатация",
					"Искусство, развлечения",
					"Консультирование",
					"Курьерская доставка",
					"Маркетинг, реклама, PR",
					"Медицина, фармацевтика",
					"Образование, наука",
					"Охрана, безопасность",
					"Продажи",
					"Производство, сырьё, с/х",
					"Страхование",
					"Строительство",
					"Такси",
					"Транспорт, логистика",
					"Туризм, рестораны",
					"Управление персоналом",
					"Фитнес, салоны красоты",
					"Юриспруденция",
				],
			},
		],
	},
	{
		name: "Услуги",
		subcategories: [
			{
				name: "Автосервис, аренда ›",
				subcategories: ["Автосервис", "Аренда авто", "Аренда спецтехники"],
			},
			{
				name: "Грузоперевозки ›",
				subcategories: ["По городу", "Между городами", "Международные"],
			},
			{
				name: "Пассажирские перевозки ›",
				subcategories: ["Трансфер", "Авто под заказ", "Другое"],
			},
			{
				name: "Грузчики, складские услуги ›",
				subcategories: ["Грузчики", "Фулфилмент"],
			},
			{
				name: "Услуги эвакуатора ›",
			},
			{
				name: "Ремонт и отделка ›",
				subcategories: [
					"Ремонт квартир и домов под ключ",
					"Дизайн интерьеров",
					"Сантехника",
					"Электрика",
					"Сборка и ремонт мебели",
					"Остекление балконов",
					"Поклейка обоев и малярные работы",
					"Потолки",
					"Полы и напольные покрытия",
					"Штукатурные работы",
					"Двери",
					"Плиточные работы",
					"Столярные и плотницкие работы",
					"Гипсокартонные работы",
					"Высотные работы",
					"Металлоконструкции и кованые изделия",
					"Изоляция",
					"Ремонт офиса",
					"Вентиляция",
					"Другое",
				],
			},
			{
				name: "Строительство ›",
				subcategories: [
					"Строительство домов под ключ",
					"Строительство бань, саун",
					"Отделка деревянных домов, бань, саун",
					"Кладочные работы",
					"Кровельные работы",
					"Сварочные работы",
					"Бетонные работы",
					"Фундаментные работы",
					"Алмазное сверление и резка",
					"Снос и демонтаж",
					"Фасадные работы",
					"Проектирование и сметы",
					"Изыскательные работы",
					"Лестницы",
					"Газификация",
					"Другое",
				],
			},
			{
				name: "Мастер на час ›",
			},
			{
				name: "Сад, благоустройство ›",
				subcategories: [
					"Cкважины, колодцы",
					"Водоёмы и фонтаны",
					"Дорожное строительство",
					"Заборы, ограждения, навесы",
					"Земляные работы",
					"Озеленение, уход за садом и огородом",
					"Рольставни и ворота",
					"Другое",
				],
			},
			{
				name: "Красота и здоровье ›",
				subcategories: [
					"Маникюр, педикюр",
					"Услуги парикмахера",
					"Ресницы, брови",
					"Косметология",
					"Эпиляция",
					"Макияж",
					"СПА-услуги, массаж",
					"Тату, пирсинг",
					"Психология",
					"Диетология",
					"Аренда рабочего места",
					"Фитнес, йога",
					"Другое",
				],
			},
			{
				name: "Ремонт и обслуживание техники ›",
				subcategories: [
					"Телевизоры",
					"Мобильные устройства",
					"Фото-, аудио-, видеотехника",
					"Кондиционеры, вентиляция",
					"Стиральные, сушильные машины",
					"Посудомоечные машины",
					"Холодильники, морозильные камеры",
					"Варочные панели, духовые шкафы",
					"Газовые котлы, водонагреватели",
					"Кофемашины",
					"Швейные машины, оверлоки",
					"Другое",
				],
			},
			{
				name: "Компьютерная помощь ›",
				subcategories: [
					"Компьютеры",
					"Принтеры",
					"Оборудование для майнинга",
					"Игровые приставки",
					"ОС и программы",
					"Интернет и другие сети",
				],
			},
			{
				name: "Монтаж и установка техники ›",
			},
			{
				name: "Оборудование и производство ›",
				subcategories: ["Аренда оборудования", "Производство, обработка"],
			},
			{
				name: "Обучение и курсы ›",
				subcategories: [
					"Предметы школы и вуза",
					"Иностранные языки",
					"Детское развитие, логопеды",
					"IT, бизнес",
					"Дизайн, рисование",
					"Красота, здоровье",
					"Спорт, танцы",
					"Вождение",
					"Музыка, театр",
					"Профессиональная подготовка",
					"Другое",
				],
			},
			{
				name: "Деловые услуги ›",
				subcategories: [
					"Бухгалтерия, финансы",
					"Консультирование",
					"Набор и коррекция текста",
					"Перевод",
					"Юридические услуги",
					"Страхование",
				],
			},
			{
				name: "IT, маркетинг ›",
				subcategories: [
					"Реклама, маркетинг, продвижение",
					"Программирование, настройка CRM",
					"Создание сайтов и приложений",
				],
			},
			{
				name: "Реклама, полиграфия ›",
				subcategories: ["Маркетинг, реклама, PR", "Полиграфия, дизайн"],
			},
			{
				name: "Вывоз мусора и вторсырья ›",
			},
			{
				name: "Уборка ›",
				subcategories: [
					"Генеральная уборка",
					"Дезинфекция, дезинсекция",
					"Мойка окон",
					"Простая уборка",
					"Уборка после ремонта",
					"Чистка ковров",
					"Чистка мягкой мебели",
				],
			},
			{
				name: "Бытовые услуги ›",
				subcategories: [
					"Изготовление ключей",
					"Пошив и ремонт одежды",
					"Ремонт часов",
					"Химчистка, стирка",
					"Ювелирные услуги",
				],
			},
			{
				name: "Праздники и мероприятия ›",
			},
			{
				name: "Доставка еды и продуктов ›",
			},
			{
				name: "Фото- и видеосъёмка ›",
			},
			{
				name: "Няни, сиделки ›",
			},
			{
				name: "Уход за животными ›",
			},
			{
				name: "Искусство ›",
			},
			{
				name: "Охрана, безопасность ›",
			},
			{
				name: "Другое ›",
			},
		],
	},
	{
		name: "Личные вещи",
		subcategories: [
			{
				name: "Одежда, обувь, аксессуары ›",
				subcategories: [
					"Женская одежда",
					"Женская обувь",
					"Мужская одежда",
					"Мужская обувь",
					"Сумки, рюкзаки и чемоданы",
					"Аксессуары",
				],
			},
			{
				name: "Десткая одежда и обувь ›",
				subcategories: ["Для девочек", "Для мальчиков"],
			},
			{
				name: "Товары для детей и игрушки ›",
				subcategories: [
					"Детские коляски",
					"Детская мебель",
					"Велосипеды и самокаты",
					"Товары для кормления",
					"Автомобильные кресла",
					"Постельные принадлежности",
					"Игрушки",
					"Товары для купания",
					"Товары для школы",
				],
			},
			{
				name: "Красота и здоровье ›",
				subcategories: [
					"Приборы и аксессуары",
					"Парфюмерия",
					"Средства гигиены",
					"Косметика",
					"Средства для волос",
					"Медицинские изделия",
					"Другое",
				],
			},
			{
				name: "Часы и украшения ›",
				subcategories: ["Ювелирные изделия", "Часы", "Бижутерия"],
			},
		],
	},
	{
		name: "Для дома и дачи",
		subcategories: [
			{
				name: "Ремонт и строительство ›",
				subcategories: [
					"Стройматериалы",
					"Инструменты",
					"Сантехника, водоснабжение и сауна",
					"Двери",
					"Садовая техника",
					"Окна и балконы",
					"Камины и обогреватели",
					"Готовые строения и срубы",
					"Потолки",
				],
			},
			{
				name: "Мебель и интерьер ›",
				subcategories: [
					"Кровати, диваны и кресла",
					"Шкафы, комоды и стеллажи",
					"Столы и стулья",
					"Текстиль и ковры",
					"Кухонные гарнитуры",
					"Предметы интерьера, искусство",
					"Освещение",
					"Компьютерные столы и кресла",
					"Подставки и тумбы",
					"Другое",
				],
			},
			{
				name: "Бытовая техника ›",
				subcategories: [
					"Для кухни",
					"Для дома",
					"Климатическое оборудование",
					"Для индивидуального ухода",
					"Другое",
				],
			},
			{
				name: "Продукты питания ›",
			},
			{
				name: "Растения ›",
			},
			{
				name: "Посуда и товары для кухни ›",
				subcategories: ["Посуда", "Товары для кухни"],
			},
		],
	},
	{
		name: "Запчасти и аксессуары",
		subcategories: [
			{
				name: "Запчасти ›",
				subcategories: [
					"Для автомобилей",
					"Для мототехники",
					"Для грузовиков и спецтехники",
					"Для водного транспорта",
				],
			},
			{
				name: "Шины, диски и колёса ›",
				subcategories: [
					"Шины",
					"Шины для грузовиков и спецтехники",
					"Мотошины",
					"Диски",
					"Колпаки",
					"Колёса",
				],
			},
			{
				name: "Аудио- и видеотехника ›",
			},
			{
				name: "Аксессуары ›",
			},
			{
				name: "Тюнинг ›",
			},
			{
				name: "Багажники и фаркопы ›",
			},
			{
				name: "Инструменты ›",
			},
			{
				name: "Прицепы ›",
			},
			{
				name: "Экипировка ›",
			},
			{
				name: "Масла и автохимия ›",
			},
			{
				name: "Противоугонные устройства ›",
				subcategories: [
					"Автосигнализации",
					"Иммобилайзеры",
					"Механические блокираторы",
					"Спутниковые системы",
				],
			},
			{
				name: "GPS-навигаторы ›",
			},
		],
	},
	{
		name: "Электроника",
		subcategories: [
			{
				name: "Телефоны ›",
				subcategories: [
					"Мобильные телефоны",
					"Аксессуары",
					"Рации",
					"Стационарные телефоны",
				],
			},
			{
				name: "Аудио и видео ›",
				subcategories: [
					"Телевизоры и проекторы",
					"Наушники",
					"Акустика, колонки, сабвуферы",
					"Аксессуары",
					"Музыкальные центры, магнитолы",
					"Усилители и ресиверы",
					"Видеокамеры",
					"Видео, DVD и Blu-ray плееры",
					"Кабели и адаптеры",
					"Музыка и фильмы",
					"Микрофоны",
					"MP3-плееры",
				],
			},
			{
				name: "Товары для компьютера ›",
				subcategories: [
					"Комплектующие",
					"Мониторы",
					"Сетевое оборудование",
					"Клавиатуры и мыши",
					"Аксессуары",
					"Джойстики и рули",
					"Флэшки и карты памяти",
					"Акустика",
					"Переносные жёсткие диски",
					"Веб-камеры",
					"ТВ-тюнеры",
				],
			},
			{
				name: "Игры, приставки и программы ›",
				subcategories: [
					"Игровые приставки",
					"Игры для приставок",
					"Программы",
					"Компьютерные игры",
				],
			},
			{
				name: "Ноутбуки ›",
			},
			{
				name: "Настольные компьютеры ›",
				subcategories: ["Системные блоки", "Моноблоки", "Другое"],
			},
			{
				name: "Фототехника ›",
				subcategories: [
					"Оборудование и аксессуары",
					"Объективы",
					"Компактные фотоаппараты",
					"Плёночные фотоаппараты",
					"Зеркальные фотоаппараты",
					"Бинокли и телескопы",
				],
			},
			{
				name: "Планшеты и электронные книги ›",
				subcategories: ["Планшеты", "Аксессуары", "Электронные книги"],
			},
			{
				name: "Оргтехника и расходники ›",
				subcategories: [
					"МФУ, копиры и сканеры",
					"Принтеры",
					"Канцелярия",
					"ИБП, сетевые фильтры",
					"Телефония",
					"Уничтожители бумаг",
					"Расходные материалы",
				],
			},
		],
	},
	{
		name: "Хобби и отдых",
		subcategories: [
			{
				name: "Билеты и путешествия ›",
				subcategories: [
					"Карты, купоны",
					"Концерты",
					"Путешествия",
					"Спорт",
					"Театр, опера, балет",
					"Цирк, кино",
					"Шоу, мюзикл",
				],
			},
			{
				name: "Велосипеды ›",
				subcategories: [
					"Горные",
					"Дорожные",
					"ВМХ",
					"Детские",
					"Запчасти и аксессуары",
				],
			},
			{
				name: "Книги и журналы ›",
				subcategories: [
					"Журналы, газеты, брошюры",
					"Книги",
					"Учебная литература",
				],
			},
			{
				name: "Коллекционирование ›",
				subcategories: [
					"Банкноты",
					"Билеты",
					"Вещи знаменитостей, автографы",
					"Военные вещи",
					"Грампластинки",
					"Документы",
					"Жетоны, медали, значки",
					"Игры",
					"Календари",
					"Картины",
					"Киндер-сюрприз",
					"Конверты и почтовые карточки",
					"Марки",
					"Модели",
					"Монеты",
					"Открытки",
					"Пепельницы, зажигалки",
					"Пластиковые карточки",
					"Спортивные карточки",
					"Фотографии, письма",
					"Этикетки, бутылки, пробки",
					"Другое",
				],
			},
			{
				name: "Музыкальные инструменты ›",
				subcategories: [
					"Аккордеоны, гармони, баяны",
					"Гитары и другие струнные",
					"Духовые",
					"Пианино и другие клавишные",
					"Скрипки и другие смычковые",
					"Ударные",
					"Для студии и концертов",
					"Аксессуары",
				],
			},
			{
				name: "Охота и рыбалка ›",
			},
			{
				name: "Спорт и отдых ›",
				subcategories: [
					"Бильярд и боулинг",
					"Дайвинг и водный спорт",
					"Единоборства",
					"Зимние виды спорта",
					"Игры с мячом",
					"Настольные игры",
					"Пейнтбол и страйкбол",
					"Ролики и скейтбординг",
					"Теннис, бадминтон, пинг-понг",
					"Туризм",
					"Фитнес и тренажёры",
					"Спортивное питание",
					"Другое",
				],
			},
		],
	},
	{
		name: "Животные",
		subcategories: [
			{
				name: "Собаки ›",
			},
			{
				name: "Кошки ›",
			},
			{
				name: "Птицы ›",
			},
			{
				name: "Аквариум ›",
			},
			{
				name: "Другие животные ›",
				subcategories: [
					"Амфибии",
					"Грызуны",
					"Кролики",
					"Лошади",
					"Рептилии",
					"С/х животные",
					"Хорьки",
					"Другое",
				],
			},
			{
				name: "Товары для животных ›",
			},
		],
	},
	{
		name: "Бизнес и оборудование",
		subcategories: [
			{
				name: "Готовый бизнес ›",
				subcategories: [
					"Франшизы",
					"Интернет-магазины и IT",
					"Общественное питание",
					"Производство",
					"Развлечения",
					"Сельское хозяйство",
					"Строительство",
					"Сфера услуг",
					"Магазины и пункты выдачи заказов",
					"Автобизнес",
					"Красота и уход",
					"Стоматология и медицина",
					"Туризм",
					"Другое",
				],
			},
			{
				name: "Оборудование для бизнеса ›",
				subcategories: [
					"Промышленное",
					"Логистика и склад",
					"Торговое",
					"Пищевое",
					"Для салона красоты",
					"Для автобизнеса",
					"Майнинг",
					"Лабораторное",
					"Медицинское",
					"Телекоммуникационное",
					"Другое",
				],
			},
		],
	},
];


export default function TreeSelect(props) {
	const [listVisible, setListVisible] = useState(false)
	const handleKeyUp = (e) => {
		if (e.key === 'Escape') {
			setListVisible(false)
			document.removeEventListener('keyup', handleKeyUp)
		}
	}

	return (
		<div className={classes.content}>
			<button onClick={() => setListVisible(!listVisible)}>
				<svg width="20" height="20" fill="none" xmlns="http://www.w3.org/2000/svg">
					<g clip-path="url(#a)" stroke="#fff" stroke-width="1.5">
						<path d="m15.625 13.125 2.5 2.5M0 4.375h5m-5 5h3.75m-3.75 5h5"></path>
						<circle cx="11.875" cy="9.375" r="4.875"></circle>
					</g>
				</svg>
				<div>
					<span>Все&nbsp;категории</span>
				</div>
			</button>
			{listVisible ?
				<div className={classes.menu}>
					{categories.map((category) => (
						<Category key={category.name} category={category} />
					))}
				</div>
				:
				<div></div>
			}
		</div>
	)
}
// Row view for demonstrate purposes
function Subcategory({ subcategory }) {
	if (typeof subcategory === 'string') {
		return <div className={classes.subcategory}></div>;
	}

	return (
		<div className={classes.subcategory} onMouseEnter={() => console.log("Mouse entered")}>
			<div className={classes.subcategoryName}>{subcategory.name}</div>
			{subcategory.subcategories && (
				<div className={classes.subcategoriesContainer}>
					{subcategory.subcategories.map((subSubcategory, index) => (
						<Subcategory key={index} subcategory={subSubcategory} />
					))}
				</div>
			)}
		</div>
	);
}

function Category({ category }) {
	const [subcategoriesVisible, setSubcategoriesVisible] = useState(false)
	return (
		<div className={classes.categoryContainer}>
			<div className={classes.categoryName} onMouseOver={() => { setSubcategoriesVisible(true) }} onMouseLeave={() => { setSubcategoriesVisible(false) }}>{category.name}</div>
			<div className={classes.subcategoriesContainer}>
				{subcategoriesVisible && category.subcategories.map((subcategory, index) => (
					<Subcategory key={index} subcategory={subcategory} />
				))}
			</div>
		</div>
	);
}

